//INVRPJCL JOB  1,NOTIFY=&SYSUID
//COBOL1   EXEC IGYWCLG,
//         PARM.COBOL='XREF'
//COBOL.SYSPRINT DD SYSOUT=*
//COBOL.SYSIN    DD DSN=G068.COBOLPGM(INVRPT),DISP=SHR
//GO.SYSOUT      DD SYSOUT=*
//GO.SYSPRINT    DD SYSOUT=*
//GO.INVIN       DD DSN=G068.COBOLIN(INVENT),DISP=SHR
//GO.INVOUT      DD DSN=G068.COBOLOUT(INVPRT),DISP=SHR
//
